{"Caption":"Figure 4. Computing HDR images from a sequence of 100 noisy im- ages captured by a 14-bit handheld moving camera for three different scenes. The noise in the input images is higher in dark regions, as shown in the tone-mapped images. Our approach produces sharp and clean HDR images, and works for complex scenes with large depth variation. The cake scene has dynamic flames, and therefore does not have a ground truth. Best viewed electronically. ","ImageText":[{"Text":"Raw","TextBB":[561.826,230.394,584.467,241.527],"Rotation":0},{"Text":"Noisy","TextBB":[587.58,230.394,617.331,241.527],"Rotation":0},{"Text":"Images","TextBB":[620.444,230.394,656.409,241.527],"Rotation":0},{"Text":"Tone-Mapped","TextBB":[538.371,372.829,607.923,383.962],"Rotation":0},{"Text":"Noisy","TextBB":[611.036,372.829,640.787,383.962],"Rotation":0},{"Text":"Images","TextBB":[643.9,372.829,679.866,383.962],"Rotation":0},{"Text":"Our","TextBB":[579.54,515.264,598.905,526.397],"Rotation":0},{"Text":"Results","TextBB":[602.019,515.264,638.694,526.397],"Rotation":0},{"Text":"Tone-Mapped","TextBB":[538.587,657.698,608.139,668.832],"Rotation":0},{"Text":"Ground","TextBB":[611.253,657.698,649.298,668.832],"Rotation":0},{"Text":"Truth","TextBB":[652.411,657.698,679.646,668.832],"Rotation":0}],"Mention":["Tone-Mapped Ground Truth\nFigure 4. Computing HDR images from a sequence of 100 noisy im-\nages captured by a 14-bit handheld moving camera for three different\nscenes. The noise in the input images is higher in dark regions, as\nshown in the tone-mapped images. Our approach produces sharp and\nclean HDR images, and works for complex scenes with large depth\nvariation. The cake scene has dynamic flames, and therefore does not\nhave a ground truth. Best viewed electronically.\n","HDR Imaging by Denoising Our first scene consists of a set\nof books, ranging from 1 meter to 2 meters from the camera,\nwith a few surrounding objects in a dark room (Figure 4, the\nfirst row). Such a scene introduces spatially-varying motion in\nthe image plane, which can not be handled by the latest HDR\nimaging method [22]. The input images are sharp but noisy\n(first column); The noise is especially high in dark regions as\nshown in the tone mapped image (second column). The third\ncolumn is our result, in which object details in dark regions\nare revealed. We use the tonemap function in Matlab with\ndefault parameters to compute the tonemapped images.\nThe second scene has many objects occluding each other\nwith very detailed objects like hair (Figure 4, the second row).\nOur approach produces a HDR image that well preserves these\ndetails. The third scene (the third row) simulates a birthday\nparty environment. Because of the fluttering flame on the cake,\nwe did not record the ground truth. In our result, we see clearly\nthe texture on the table surface and the birthday card.\n"],"Page":7,"Number":4,"Type":"Figure","CaptionBB":[435,671,780,775],"Height":1100,"Width":850,"DPI":100,"ImageBB":[435,100,780,671]}