{"Caption":"Figure 2: A deteriorated safety acetate film negative.","ImageText":[{"Text":"(a)","TextBB":[127,185.717,139.186,195.747],"Rotation":0},{"Text":"Base","TextBB":[143.833,185.717,165.248,195.747],"Rotation":0},{"Text":"layer","TextBB":[168.166,185.717,190.019,195.747],"Rotation":0},{"Text":"(b)","TextBB":[282.333,185.717,295.186,195.747],"Rotation":0},{"Text":"Emulsion","TextBB":[299.833,185.717,342.201,195.747],"Rotation":0},{"Text":"layer","TextBB":[345,185.717,366.853,195.747],"Rotation":0}],"Mention":["For instance, photographic negatives, taken from 1925 to as late\nas 1955, are suffering devastating forms of deterioration [Horvath\n1987]. These three decades encompass vast and diverse collections\nof safety negatives. Safety negatives were developed to move away\nfrom the ammability of cellulose nitrate, which was used in still\nphotography until the early 1920s. The safety film that emerged\nwas varied in its composition but largely based on cellulose diac-\netate. This new material lessened the risk of fire damage, but was\nnot an ideal film base because of its tendency to absorb moisture\ncausing dimensional deformations. In fact, it has been discovered\nthat the chemical decomposition of this acetate, or base, layer, even\nunder proper conservation, causes profound distortion in the film\ncontent as shown in Fig. 2(a) 2(b). When imaged, the effects of\nthese distortions are obvious (see Fig. 1(a)).\n","(a) A close-up\nof the negative in\nFig. 12(a)\n(b) The\nresult.\n","The next example is an architectural recording of a home. Fig. 12(a)\nshows the positive image of the photograph with obvious distortions\nin photometry and geometry. The photometrically corrected version\nof the negative is shown in Fig. 12(b) and the surface orientations\nare shown in Fig. 12(c).\n","Fig. 14(a) shows a closeup of a warped area of the negative from\nFig. 12. In Fig. 14(a), a crack in the emulsion layer is marked\nin solid white. This area contains some information loss where\nthe material has chipped away, but much of the content remains.\nIt can be seen through the geometric flattening process shown in\nFig. 14(b) that both sides of the crack are brought back together\nduring restoration. Also, a close-up of Fig. 13 shows the resultant\ngeometrically flattened negative in Fig. 14(d) with a side-by-side\ncomparison on the unflattened photo (Fig. 14(c)).\n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[107,217,374,230],"Height":1100,"Width":850,"DPI":100,"ImageBB":[78,74,406,198]}