{"Caption":"Figure 3: Probability of DNS poisoning attack success, for fixed and randomized ports. ","ImageText":[],"Mention":["Other parameters of course affect the actual chance of success.\nBandwidth and traffic loss are also critical variables we’ve not in-\ncluded in our model. However, with the pervasive availability of\nbotnets, compromised machines, and proxies, we assume an at-\ntacker would not be constrained. A more complex model would\nintroduce this as a separate constraint. Since network measurement\nstudies have generally observed that bandwidth correlates positively\nto RTT [7], we omitted this parameter in our simplified model.\nFigure 3 shows the chance an attack will be successful against a\nvariety of defenses, and illustrates the properties of the simplified\nmodel. The logscale x-axis depicts the number of attack packets.\nBased on the RTT study (and assuming a window of 100ms, with\nthe attacker using a 100Mb\/s connection), some 13,000 packets can\nbe sent. The linear y-axis shows a range of θ, the combined IPs of\nthe authority and recursive servers. The logscale z-axis shows the\nprobability of a successful attack. RFC 1912 recommends a small\nnumber of authority DNS servers, and no more than≈ 7 [6]. While\nnot a standard, this advice is general wisdom, and even large enter-\nprise zones (e.g., search engines, Fortune 500 companies) have just\nthree or four public IPs for their authority server farms.\nThe upper mesh drawn in Figure 3 shows the rate of success\nagainst a DNS server using just ID field randomization and a fixed\nport. Unless significant numbers of additional authority servers are\nbrought online (in excess of those normally used, and more than\nthose recommended by RFC 1912), the chance of an attacker suc-\ncessfully poisoning a DNS server rises with the number of attack\npackets. In general, Figure 3 shows that IP diversity provides a\nlinear increase in security, while port randomization provides an\nexponential improvement.\nThe lower mesh in Figure 3 shows a much better resistance to\nforgery attempts. One might be tempted to think that port random-\nization has solved DNS poisoning completely. While clearly use-\nful, [28, 29], port randomization can be overcome by determined\nattackers able to send large amounts of traffic [20]. We desire addi-\ntional means of security for several reasons:\n"],"Page":6,"Number":3,"Type":"Figure","CaptionBB":[73,368,407,396],"Height":1100,"Width":850,"DPI":100,"ImageBB":[77,78,426,327]}