{"Caption":"Figure 2: System Prototype. Our system consists of an array of small, low-cost, low-power ultrasonic sources and detectors (microphones) placed on the body (left). The ultrasonic sources (top-middle) sequentially emit ultrasonic pulses, which are received by the microphones (bottom-middle) and processed to yield distance measurements for all source-microphone pairs. To increase precision and the sampling rate, as well as to alleviate visibility problems, each sensor board is also equipped with a 3-axis gyroscope and a 3-axis accelerometer that measure rotation rates and linear accelerations respectively (bottom-middle). The data collection is managed by a small driver box (right) using a laptop hard disk for storage; both the driver box and the laptop are carried by the user in a backpack. ","ImageText":[{"Text":"Ultrasonic","TextBB":[363.562,75.4782,414.206,89.9561],"Rotation":0},{"Text":"Source","TextBB":[417.849,75.4782,452.896,89.9561],"Rotation":0},{"Text":"Backpack","TextBB":[591.783,84.0296,663.706,105.746],"Rotation":0},{"Text":"(2.5cm","TextBB":[386.364,91.4416,407.318,99.8871],"Rotation":0},{"Text":"x","TextBB":[409.448,91.4416,412.817,99.8871],"Rotation":0},{"Text":"1cm)","TextBB":[414.947,91.4416,430.123,99.8871],"Rotation":0},{"Text":"Driver","TextBB":[542.868,132.838,573.795,147.316],"Rotation":0},{"Text":"Box","TextBB":[577.447,132.838,596.428,147.316],"Rotation":0},{"Text":"Microphone","TextBB":[233.954,235.746,278.595,246.605],"Rotation":0},{"Text":"Gyroscope","TextBB":[272.112,266.614,312.335,277.472],"Rotation":0},{"Text":"Pulse","TextBB":[448.896,174.809,471.12,186.753],"Rotation":0},{"Text":"A\/D","TextBB":[511.311,241.927,523.979,258.872],"Rotation":3},{"Text":"Converters","TextBB":[523.561,224.557,536.229,273.066],"Rotation":3},{"Text":"Micro−Controller","TextBB":[222.044,184.706,286.574,195.565],"Rotation":0},{"Text":"USB","TextBB":[611.009,179.454,623.677,197.849],"Rotation":3},{"Text":"Sensor","TextBB":[310.228,161.76,345.11,176.238],"Rotation":0},{"Text":"(2.5cm","TextBB":[302.911,175.536,323.864,183.982],"Rotation":0},{"Text":"x","TextBB":[325.995,175.536,329.363,183.982],"Rotation":0},{"Text":"2.5cm)","TextBB":[331.493,175.536,352.447,183.982],"Rotation":0},{"Text":"Pulse","TextBB":[511.311,176.86,523.979,200.44],"Rotation":3},{"Text":"Generator","TextBB":[523.56,166.216,536.229,211.111],"Rotation":3},{"Text":"(22cm","TextBB":[536.853,146.614,555.745,155.059],"Rotation":0},{"Text":"x","TextBB":[557.875,146.614,561.244,155.059],"Rotation":0},{"Text":"22cm","TextBB":[563.374,146.614,579.659,155.059],"Rotation":0},{"Text":"x","TextBB":[581.789,146.614,585.158,155.059],"Rotation":0},{"Text":"6cm)","TextBB":[587.288,146.614,602.464,155.059],"Rotation":0},{"Text":"Micro−","TextBB":[557.593,202.156,589.14,214.824],"Rotation":0},{"Text":"Controller","TextBB":[551.512,213.093,595.216,225.761],"Rotation":0},{"Text":"Hard","TextBB":[703.394,205.676,723.731,217.62],"Rotation":0},{"Text":"Disk","TextBB":[726.743,205.676,744.549,217.62],"Rotation":0},{"Text":"Battery","TextBB":[591.416,256.167,623.734,268.835],"Rotation":0},{"Text":"Accelerometer","TextBB":[326.798,276.335,381.852,287.194],"Rotation":0}],"Mention":["First, we outline the architecture of our system and describe the in-\ndividual components. As illustrated in Figure 2, our system is con-\ntrolled by a custom-built driver box connected to a laptop using a\nUSB interface. The driver box is also connected to eight ultrasonic\nsources and eighteen sensor boards using shielded 3-wire cables.\nAll sensors are attached to the user’s garment. The driver box pro-\nvides pulse signals to the ultrasonic sources, polls data from the\nsensors, and provides power to the sensor boards. The driver box is\npowered by a rechargeable Lithium-Ion battery pack with 4.4 AHr\ncapacity, which provides several hours of safe operation (the current\ndrawn by our system is 1.5A). A laptop records the data on a hard\ndrive but is not used for any processing. We envision a commercial\nsystem that replaces the driver box and laptop, both of which are\ncurrently carried in a backpack, with a single iPod-sized unit.\n","Therefore, our signal sources employ off-the-shelf piezoelectric\ntransducers (Figure 2 top-center) to emit pulses at ultrasonic fre-\nquencies (40 kHz). They are mounted onto small plastic plates,\nattached to the garment, and wired to the pulse-generating driver\nbox. The pulses are detected by conventional audio microphones\n(Figure 2, bottom-center). Although they do not exhibit optimal re-\nsponse in the 40 kHz range, they are able to clearly detect our ultra-\nsonic pulses while offering several advantages over ultrasonic de-\ntectors: they are small in size (2.5mm3); they have a wide-angle re-\nsponse — there is no need for accurate alignment with the sources;\nand they have a wide bandwidth — we do not need to tune them\nto the exact frequency of the ultrasonic source. We arranged the\nultrasonic sources such that they see most of the microphones most\nof the time: seven sources around the chest and belly pointing for-\nward, with the eighth source on the brim of a hat pointing down\n(Figure 2, left).\n","In addition to the microphone, each sensor board (Figure 2, bottom-\ncenter) is equipped with a 3-axis rotation rate sensing unit (the\ngyroscope), and a 3-axis linear acceleration sensing unit (the ac-\ncelerometer). Their measurements enhance the precision and frame\nrate of the ultrasonic components. Furthermore, they alleviate the\nline-of-sight problems associated with acoustic signals. An on-\nboard micro-controller collects the inertial data, combines it with\nthe acoustic signal, and sends it to the driver box.\n"],"Page":5,"Number":2,"Type":"Figure","CaptionBB":[73,334,775,416],"Height":1100,"Width":850,"DPI":100,"ImageBB":[73,75,774,312]}