{"Caption":"Figure 18: Per-connection end-to-end throughput complemen- tary CDF. The median throughput is about 30 KBytes\/sec, which is consistent with the upstream bandwidth of most cable modem backed APs. ","ImageText":[{"Text":"Fraction","TextBB":[97.4828,561.66,106.983,597.781],"Rotation":3},{"Text":"of","TextBB":[97.4828,550.54,106.983,558.88],"Rotation":3},{"Text":"connections","TextBB":[97.4828,494.399,106.983,547.76],"Rotation":3},{"Text":"1","TextBB":[130.91,458.105,136.47,467.605],"Rotation":0},{"Text":"0.8","TextBB":[122.57,491.688,136.47,501.188],"Rotation":0},{"Text":"0.6","TextBB":[122.57,525.313,136.47,534.813],"Rotation":0},{"Text":"0.4","TextBB":[122.57,558.897,136.47,568.397],"Rotation":0},{"Text":"0.2","TextBB":[122.57,592.522,136.47,602.022],"Rotation":0},{"Text":"0","TextBB":[130.91,626.105,136.47,635.605],"Rotation":0},{"Text":"0","TextBB":[141.08,636.105,146.64,645.605],"Rotation":0},{"Text":"20","TextBB":[184.716,636.105,195.836,645.605],"Rotation":0},{"Text":"40","TextBB":[231.091,636.105,242.211,645.605],"Rotation":0},{"Text":"60","TextBB":[277.508,636.105,288.628,645.605],"Rotation":0},{"Text":"Throughput","TextBB":[203.17,651.105,254.311,660.605],"Rotation":0},{"Text":"(KBytes\/sec)","TextBB":[257.091,651.105,313.773,660.605],"Rotation":0},{"Text":"80","TextBB":[323.883,636.105,335.003,645.605],"Rotation":0},{"Text":"100","TextBB":[367.52,636.105,384.2,645.605],"Rotation":0}],"Mention":["Once a connection has been established, Scanping begins\ntransmitting data from the car to the server. Figure 18 shows the\ncomplementary CDF of the per-connection end-to-end throughput.\nThe median connection throughput is about 30 KBytes\/s. 80% of\nall the connections (between the 10th and 90th percentiles) observe\nTCP performance between 10 KBytes\/s and 50 KBytes\/s, a fairly\nnarrow range). These results are not surprising in light of the fact\nthat in urban Wi-Fi networks, most APs reside on home networks\nthat receive their Internet connectivity through cable modems or\nDSL links. Typically, these types of connections offer upstream\nbandwidths that are roughly similar to the values we observe in\nthis data. Because we use a 1 Mbit\/s radio rate, we don’t see any\nthroughput results that are higher than 100 KBytes\/s.\nThe relatively high packet loss rates shown in the previous sec-\ntion may also impair TCP throughput, although the connection at-\ntempts that actually succeeded in transferring some data over TCP\nprobably had a lower average loss rate than those that only suc-\nceeded in transmitting AP pings. Moreover, as we discussed the\naverage reported in the previous section is not uniform over the du-\nration of the connection since the middle of a connection, when\nmost data is sent, has a lower packet loss rate than the end.\nFigure 19 shows the CDF the total number of bytes transferred\nvia TCP per connection. The median connection transfers about\n216 KBytes of data, which, at 30 KBytes\/sec, suggests a connec-\ntion duration of about 8 seconds. This number is consistent with\nour analysis of server logs, which show that the typical connection\nhas packets arriving at the server for about this much time. Some\nconnections (about 10%) transfer only one packet, and in some of\nthose cases the TCP ACK was not received by the mobile unit. No-\ntice from the CDF that the number of bytes delivered has a heavy\ntail, presumably corresponding to times when a car is at a stop light\nor is in heavy traffic.\n"],"Page":10,"Number":18,"Type":"Figure","CaptionBB":[73,678,408,735],"Height":1100,"Width":850,"DPI":100,"ImageBB":[95,455,386,663]}