{"Caption":"Figure 1: Operating at a lower voltage and tolerat- ing errors instead of the conventional case of choos- ing the highest minimum voltage requirement may help decrease energy consumption. Considering that Energy = voltage2 × time\/resistance, decreasing volt- age decreases the energy consumption quadratically. ","ImageText":[{"Text":"CPU","TextBB":[192.4,167.788,218.355,179.32],"Rotation":0},{"Text":"CPU","TextBB":[293.538,170.14,319.493,181.673],"Rotation":0},{"Text":"Flash","TextBB":[340.295,159.826,351.828,189.888],"Rotation":3},{"Text":"Half-wits","TextBB":[292.941,136.803,340.067,148.336],"Rotation":0},{"Text":"Flash","TextBB":[232.249,156.692,243.782,186.753],"Rotation":3},{"Text":"Voltage","TextBB":[138.18,132.115,149.713,173.129],"Rotation":3},{"Text":"Conventional","TextBB":[176.562,109.492,248.316,121.024],"Rotation":0}],"Mention":["Approach. Our approach reduces the operating volt-\nage of the microcontroller to a point at which the result-\ning energy savings of the CPU portion of the workload\nexceeds the energy cost of the algorithms for ensuring\nreliable writes (Figure 1). The technique requires min-\nimal or no hardware modification and also allows for\nRFID-scale devices to better exploit capacitors as power\nsupplies. The capacitor provides finite energy and there-\nfore the voltage decays exponentially. The long tail of\nthe curve provides insufficient voltage for conventional\nwrites to flash memory, but is sufficient for reliable stor-\n","stored and a sign bit would be set for future data ac-\ncess. An array of sign bits can be stored separately from\nthe data to avoid disturbing word alignment. A previous\nwork [26] uses a similar technique for multi-level cell\n(MLC) flash memories with four levels; their techniques\nresult in a significant decrease of energy consumption.\nFigure 11 shows that using the sign-bit scheme decreases\nthe error rate at low voltage for the same ECG data used\nin Section 2. For this specific example, out of 168 bytes\nof ECG data, 160 bytes are overweight and therefore us-\ning the sign-bit scheme greatly decreased the error rate.\nThe sign-bit approach involves very lightweight compu-\ntation (counting the number of ones) and increases the\nnumber of writes by a factor of one-eighth. Therefore,\nthe effect of this improvement on energy consumption\nand delay should be comparatively small.\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[98,241,413,338],"Height":1100,"Width":850,"DPI":100,"ImageBB":[136,106,372,216]}