{"Caption":"Figure 9. Time-searcher created by query relaxation. A user selects a range and relaxes the selection to create a tool that selects the time-series that pass through the range. Moving or resizing the range updates the relaxed query results. The images are cropped close-ups of a time-series of homicide counts by age group. ","ImageText":[],"Mention":["Query relaxation can also be applied to multiple items or to \nrange queries. Figure 8 shows a range selection that has \nbeen relaxed along the ‗race‘ dimension. The resulting \nquery selects all victims whose race matches that of any \nvictim contained within the range bounds. Figure 9 shows a \nsimilar relaxation in a time-series visualization. The plot \nshows aggregated homicide counts over time, grouped by \nage into 5-year bins. Creating a range query over this \nvisualization selects all individual data points within the \nrange. Relaxing the query along the age dimension selects \nall time-series that pass through the selection range. \nBecause we retain the query structure, subsequent resizing \nor repositioning of the range results in dynamic updates to \nthe selection, enabling interactive querying similar to \nHochheiser and Shneiderman‘s TimeSearcher [14]. \n","If we update the selection clause for the inner query, the \nresult set of the relaxed query also updates. For instance, if \nwe relax a range query rather than an item selection \n(Figures 8 and 9), we can interactively update the range \nbounds to refine the inner query, dynamically changing the \ninput to the relaxation. If dynamic updates are not desired, \nwe can collapse the query structure by evaluating the inner \nquery to generate a query without nesting. To generate a \n―collapsed‖ query, we evaluate the relaxation clause, \nreplacing it with a static clause such as (race = ‘Asian’). \n"],"Type":"Figure","Number":9,"Page":5,"CaptionBB":[438,881,777,945],"Height":1100,"Width":850,"DPI":100,"ImageBB":[441,737,777,877]}