{"Caption":"Figure 4: Failure detection with RBPF. The question mark indicates that the generation of the successor corresponding to the true trajectory is generated stochastically. ","ImageText":[{"Text":"t","TextBB":[564.997,73.8643,567.239,82.7934],"Rotation":0},{"Text":"F-1","TextBB":[567.466,78.8449,575.284,84.8584],"Rotation":0},{"Text":"t","TextBB":[717.263,73.8643,719.506,82.7934],"Rotation":0},{"Text":"F","TextBB":[719.733,78.8449,722.753,84.8584],"Rotation":0},{"Text":"<no,ok>","TextBB":[488.946,227.272,505.227,232.738],"Rotation":0},{"Text":"...","TextBB":[528.288,218.124,539.194,234.342],"Rotation":0},{"Text":"<no,ok>","TextBB":[561.704,227.272,577.985,232.738],"Rotation":0},{"Text":"?","TextBB":[609.771,220.455,618.396,241.958],"Rotation":0},{"Text":"Stochastic","TextBB":[579.977,284.718,607.854,291.825],"Rotation":0},{"Text":"sampling","TextBB":[609.779,284.718,635.379,291.825],"Rotation":0},{"Text":"<no,failed>","TextBB":[646.315,227.272,669.844,232.738],"Rotation":0},{"Text":"...","TextBB":[712.001,134.88,738.971,152.986],"Rotation":1},{"Text":"...","TextBB":[644.675,136.196,671.644,154.303],"Rotation":1},{"Text":"...","TextBB":[565.167,138.664,592.137,156.771],"Rotation":1},{"Text":"<no,failed>","TextBB":[710.021,227.272,733.549,232.738],"Rotation":0},{"Text":"Resampling","TextBB":[656.192,280.933,688.009,288.039],"Rotation":0},{"Text":"according","TextBB":[689.924,280.933,717.003,288.039],"Rotation":0},{"Text":"to","TextBB":[655.369,288.669,660.558,295.776],"Rotation":0},{"Text":"importance","TextBB":[662.451,288.669,693.787,295.776],"Rotation":0},{"Text":"weights","TextBB":[696.04,288.669,717.964,295.776],"Rotation":0}],"Mention":["tual fault occurs.1 By contrast, with the RBPF, mode transi-\ntions are sampled stochastically (Fig. 4). For the true trajec-\ntory to be tracked, the mode transition into the failure state\nmust be sampled. Since this transition has a low prior many\nparticles will be needed, in order to detect the fault.\nNow, consider a modified model, in which the probability\nof catching a ball is 0.5, rather than 0.01. In addition, let the\nmass of the ball be small, so that the effect of catching a ball,\non the observations, is relatively small. In this case, the pos-\nterior distribution over the trajectories will be flat, as there\nwill be many trajectories in the belief state that oscillate be-\ntween the robot having and not having a ball. Initially, these\ntrajectories will have higher posterior probabilities than the\nground-truth trajectory, because they have much higher pri-\nors than the failure, and it takes several time steps before the\nevidence for the failure builds up. The RBPF, on the other\nhand, will occasionally generate a fault sample even if there\nare many alternative trajectories that have a higher posterior\nprobability. The fault trajectory may thus be present in the\nset of trajectories despite having a lower posterior probabil-\nity than other candidate trajectories. This behavior makes\nthe RBPF more robust to local maxima.\nTo summarize, the advantage of k-best enumeration is\nthat it stores the posterior probability of each trajectory ex-\nactly, rather than approximating the probability by a number\nof repeated particles. This observation has been noted in the\npast (Lerner 2002). However, the ability of k-best enumera-\ntion to track the true trajectory is critically dependent on the\nnumber of alternative trajectories with high posteriors in re-\nlation to the number of tracked trajectories k. In particular,\nif the posterior distribution over the trajectories is flat, k-\nbest enumeration will not consider the right trajectory, and\nthe RBPF performs better. This observation motivates the\ndevelopment of our algorithm that combines k-best enumer-\nation and RBPF in a greedy and stochastic search.\n","The pseudocode for the resulting algorithm is shown in\nFig. 6. Lines 4 through 13 of the algorithm implement an A*\nsearch for the k successors with the highest posterior. This\nis similar to the method for k-best enumeration described\nby (Hofbaur & Williams 2002a). The two key additions are\nas follows:\n"],"Page":3,"Number":4,"Type":"Figure","CaptionBB":[442,314,775,359],"Height":1100,"Width":850,"DPI":100,"ImageBB":[478,74,741,298]}