{"Caption":"Figure 5: Examples of plans","ImageText":[],"Mention":["nown action will be performed.\nIn order to calculate the criticality of an action, we dis-\ninguish its absolute criticality from its relative criticality.\nhe absolute criticality (AC) of an action is defined with-\nut taking into account the current plans of the agents. It\ns given a priori by the system designer and can be deter-\nined in function of a number of factors: number of agents\napable of performing the action, duration of the action, re-\nources required for the execution of the action, application\nependent information.\nThe relative criticality (RC) of an action belonging to the\nlan of an agent is proportional to the criticality of the agent\nhen it is executing the action or waiting for some other\ngent to execute it. As a consequence, the relative criticality\nf an action may vary depending on the agent plan it belongs\no. The relative criticality is calculated as follows:\n• For an external action, it is equal to the local rela-\ntive criticality (LRC). The LRC is obtained using the\nAND-aggregation function if the action is connected\nto its children by means of AND edges or the OR-\n","hat at each given instant of time, the agent is executing at\nost one action.\nUsing the same approach established by [16], we repre-\nent the plan of an agent as a directed acyclic AND\/OR\nraph where each node represents an action. The nodes are\nonnected by AND or OR edges.\nIn the example of Figure 5, after performing the action\n, Agent1 needs to have both actions B and C executed in\nrder to accomplish its plan. However, after C, only one of\nor E needs to be performed so that Agent1 accomplishes\nts plan. We call an external action an action belonging\nThe use of roles is analog to Section 4.3.\nSince unexpected events may occur in dynamic environ-\nents, agents usually interleave planning and execution.\nonsequently, their plans are established just for the short\n"],"Page":5,"Number":5,"Type":"Figure","CaptionBB":[515,232,699,245],"Height":1169,"Width":850,"DPI":100,"ImageBB":[508,74,708,206]}