{"Caption":"Figure 2: Learning nsDBNS from the Drosophila muscle development data. A. The directed net- work reported by [13]. B. The undirected networks reported by [4]. C. The nsDBN structure learned under the KNKT setting with λs = 2.0. Only the edges that occurred in greater than 50 percent of the samples are shown, with thicker edges representing connections that occurred more frequently. D. Posterior probabilities of transition times using λm = λs = 2 under the UNUT setting. Blue triangles represent the borders of embryonic, larval, pupal, and adult stages. E. Posterior probability of the number of epochs under the UNUT setting. ","ImageText":[],"Mention":["We also apply our method to identify non-stationary networks using Drosophila development gene\nexpression data from [12]. This data contains expression measurements over 66 time steps of 4028\nDrosophila genes throughout development and growth during the embryonic, larval, pupal, and adult\nstages of life. Using a subset of the genes involved in muscle development, some researchers have\nidentified a single directed network [13], while others have learned a time-varying undirected net-\nwork [4]. To facilitate comparison with as many existing methods as possible, we apply our method\nto the same data. Unfortunately, no other techniques predict non-stationary directed networks, so\nour prediction in Figure 2C is compared to the stationary directed network in Figure 2A and the\nnon-stationary undirected network in Figure 2B.\n","Despite the similarities, some notable differences exist between our prediction and the other two\npredictions. First, we predict interactions from myo61f to both prm and up, neither of which is\npredicted in the other methods, suggesting a greater role for myo61f during muscle development.\nAlso, we do not predict any interactions with twi. During muscle development in Drosophila, twi\nacts as a regulator of mef2 that in turn regulates some myosin family genes, including mlc1 and\nmhc [14]; our prediction of no direct connection from twi mirrors this biological behavior. Finally,\nwe note that in our predicted structure, actn never connects as a regulator (parent) to any other\ngenes, unlike in the network in Figure 2A. Since actn (actinin) only binds actin, we do not expect it\nto regulate other muscle development genes, even indirectly.\n","We can also look at the posterior probabilities of transition times and epochs under the UNUT\nsetting. These plots are shown in Figure 2D and 2E, respectively. The transition times with high\nposterior probabilities correspond well to the embryonic→larval and the larval→pupal transitions,\nbut a posterior peak occurs well before the supposed time of the pupal→adult transition; this reveals\nthat the gene expression program governing the transition to adult morphology is active well before\nthe fly emerges from the pupa, as would clearly be expected. Also, we see that the most probable\nnumber of epochs is three or four, mirroring closely the total number of developmental stages.\n"],"Page":7,"Number":2,"Type":"Figure","CaptionBB":[148,422,700,528],"Height":1100,"Width":850,"DPI":100,"ImageBB":[203,112,647,407]}