{"Caption":"Figure 1. A dispatching network with subscriptions laid down according to a subscription forwarding scheme. ","ImageText":[],"Mention":["client issues a subscription, a message containing the corre-\nsponding event pattern to be used for filtering is sent to the\ndispatcher the client is attached to. There, the event pattern\nis inserted in a subscription table, together with the identi-\nfier of the subscriber. Then, the subscription is propagated\nby the dispatcher, which now behaves as a subscriber with\nrespect to the rest of the dispatching network, to all of its\nneighboring dispatchers on the overlay network. In turn,\nthey record the subscription and re-propagate it towards all\ntheir neighboring dispatchers, except for the one that sent\nit. This scheme is typically optimized by avoiding propaga-\ntion of subscriptions for the same event pattern in the same\ndirection. The propagation of a subscription effectively sets\nup a route for events, through the reverse path from the pub-\nlisher to the subscriber. Requests to unsubscribe from a\ngiven event pattern are handled and propagated analogously\nto subscriptions, although at each hop entries in the sub-\nscription table are removed rather than inserted.\nFigure 1 shows a dispatching network with two dispatch-\ners subscribed1 for a “black” pattern, and one for a “gray”\npattern. (Hereafter, we ignore the presence of clients and\nconsider only dispatchers.) Arrows denote the routes laid\ndown according to these subscriptions, and reflect the con-\ntent of subscription tables. As a consequence of the sub-\nscription forwarding process we described, the routes for\nthe two separate subscriptions are laid down on the single\ntree constituting the dispatching network. This choice is\ntypical of content-based systems and is motivated by the\nfact that a single event may match multiple patterns. There-\nfore, routing on multiple independent trees, as typically\ndone by subject-based systems, would lead to inefficient du-\nplication of events along the separate trees.\n","The chart in Figure 11 shows the event delivery and over-\nhead for N = 200 nodes confined in a square area with\na side of 2 Km, with a wireless communication range of\n250 m, each moving at a velocity of 2 m\/s. These values,\nwhich are common in the research field, keep our graph con-\nnected. Moreover, after having analyzed the performance\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[443,144,740,174],"Height":1100,"Width":850,"DPI":100,"ImageBB":[453,28,733,132]}