{"Caption":"Figure 4. Method noise experience on a natural image. Displaying of the image difference u−Dh (u). From left to right and from top to bottom: original image, Gauss filtering, anisotropic filtering, Total variation minimization, Neighborhood filtering and NL-means algorithm. The visual experiments corroborate the formulas of section 2. ","ImageText":[],"Mention":["In section 2 we have computed explicitly the method\nnoise of the local smoothing filters. These formulas are cor-\nroborated by the visual experiments of Figure 4. This fig-\nure displays the method noise for the standard image Lena,\n","is been fixed in order to remove a noise of standard devia-\ntion 2.5. The method noise helps us to understand the per-\nformance and limitations of the denoising algorithms, since\nremoved details or texture have a large method noise. We\nsee in Figure 4 that the NL-means method noise does not\npresent any noticeable geometrical structures. Figure 2 ex-\nplains this property since it shows how the NL-means al-\ngorithm chooses a weighting configuration adapted to the\nlocal and non local geometry of the image.\n","struction of edges, texture and details.\nDue to the nature of the algorithm, the most favorable\ncase for the NL-means is the textured or periodic case. In\nthis situation, for every pixel i, we can find a large set of\nsamples with a very similar configuration. See Figure 2 e)\nfor an example of the weight distribution of the NL-means\nalgorithm for a periodic image. Figure 3 compares the per-\nformance of the NL-means and local smoothing filters for a\nnatural texture.\nNatural images also have enough redundancy to be re-\nstored by NL-means. Flat zones present a huge number of\nsimilar configurations lying inside the same object, see Fig-\nure 2 (a). Straight or curved edges have a complete line\nof pixels with similar configurations, see Figure 2 (b) and\n(c). In addition, natural images allow us to find many simi-\nlar configurations in far away pixels, as Figure 2 (f) shows.\nFigure 5 shows an experiment on a natural image. This ex-\nperience must be compared with Figure 4, where we display\nthe method noise of the original image. The blurred or de-\ngraded structures of the restored images coincide with the\nnoticeable structures of its method noise.\nFinally Table 1 displays the mean square error for the\n"],"Page":5,"Number":4,"Type":"Figure","CaptionBB":[93,532,749,583],"Height":1100,"Width":850,"DPI":100,"ImageBB":[239,277,605,520]}