{"Caption":"    Figure 2: Duty cycle and application utility relationship. when in active mode1 , D(i) – the duty cycle used in slot i, and B(i) – the residual battery energy at the beginning of slot i. Figure 3 shows two possible cases for Ps (i) in a time slot - it may either be lower than or higher than Pc , as shown on the left and right re- spectively. When Ps (i) is lower than Pc , some of the energy used comes from the battery, while when Ps (i) is higher than Pc , all the energy used is supplied directly from the harvested source. The crosshatched area shows the energy that is available for storage into the battery while the hashed area shows the energy drawn from the battery. When energy is stored into the battery, some of it is lost ","ImageText":[{"Text":"U","TextBB":[136.149,105.032,145.364,116.518],"Rotation":0},{"Text":"D","TextBB":[196.275,165.3,205.49,176.787],"Rotation":0},{"Text":"min","TextBB":[205.28,171.751,218.519,179.408],"Rotation":0},{"Text":"D","TextBB":[249.453,165.584,258.668,177.07],"Rotation":0},{"Text":"max","TextBB":[258.458,171.751,273.11,179.408],"Rotation":0},{"Text":"D","TextBB":[318.868,166.719,328.083,178.206],"Rotation":0}],"Mention":["Solar energy is harvested using transducers (commonly referred\nto as solar cells) that operate based on the photovoltaic effect to\nsupply electrical power to an attached load. As a power source, so-\nlar cells behave very differently from batteries. The measured I-V\ncurve of the 4-4.0-100 solar panel from Solar World [11] is shown\nin Figure 2.1. It is clear that unlike batteries, solar panels behave as\nvoltage-limited current sources with the operating point (i.e., out-\nput voltage and current) determined by the electrical impedance\nimposed by the load. Also, as marked in the figure, there is an\noperating point on the I-V curve where maximum instantaneous\npower is delivered by the solar panel. To maximize the total energy\noutput over the course of the system’s lifetime, the panel should be\noperated as close as possible to this maximal power point (MPP)\nfor as long as possible. However, this is not simple to achieve since\nthe MPP depends on several time-varying parameters such as solar\nirradiance, panel temperature, etc.\nA commonly used technique to ensure MPP operation is to iso-\nlate the load (i.e., sensor node) from the solar panel using a switch-\ning regulator. The switching characteristics of the regulator de-\ntermine the effective impedance seen by the panel and hence, the\noperating point on the I-V curve. Since the regulator’s character-\nistics can be software-controlled, the system can track the MPP as\nit changes using a perturb-and-observe approach. However, the en-\nergy benefits of MPP tracking using this method might be offset by\nthe energy consumed by the extra tracking circuitry itself. An alter-\nnative approach used in the Heliomote [7] solar harvesting module\nis to clamp the outputs of the panel to a secondary battery, which\nfixes the panel’s operating point. The authors demonstrate that, by\ncarefully choosing the panel and battery, near-MPP operation can\nbe obtained. Although sub-optimal from an MPP tracking point of\nview, this approach is attractive since it is virtually overhead free.\n","It is graphically represented in Figure 2. This is a fairly general\n"],"Page":4,"Number":2,"Type":"Figure","CaptionBB":[73,186,407,349],"Height":1100,"Width":850,"DPI":100,"ImageBB":[134,74,346,180]}