{"Caption":"Figure 1: An example of local ambiguity. Considered out of context, the segment shown may equally well be the side of the ellipse and the corner of the square. ","ImageText":[{"Text":"a","TextBB":[488.349,388.702,494.492,401.156],"Rotation":0},{"Text":"b","TextBB":[593.154,388.702,600.073,401.156],"Rotation":0},{"Text":"c","TextBB":[708.559,388.702,714.702,401.156],"Rotation":0}],"Mention":["closed. These features occur at a variety of scales. Some,\nlike the presence of a corner, describe a very small area.\nSome, like whether the shape is closed, describe the en-\ntire stroke, and some, like whether a portion of a stroke is\nstraight, arise at an intermediate scale. In order to create a\nvery flexible system, we use features at different scales, such\nas those described, as our vocabulary to describe a shape.\nQuadrilaterals can be detected by testing whether the\nshape is closed, it has four corners, and the segments be-\ntween the corners are straight. Rather than having a set of\npredefined shapes, a stroke is initially described by its fea-\ntures in this way. We take this approach in order to add new\nshapes easily and to give the user the flexibility to use unde-\nfined shapes in a sketch.\nClassifying these single features, some of which are very\nlocalized, can be problematic. Sketching styles often vary\nconsiderably, making it difficult to construct a general sys-\ntem capable of correctly classifying all instances of corners,\nparallel lines, straight lines, etc., across all users and all do-\nmains. Yet humans can perform this task consistently with-\nout extensive domain knowledge and without prior knowl-\nedge of an individual’s drawing style. Furthermore, because\nsketches are almost never drawn perfectly, they often con-\ntain internal inconsistencies, i.e., the same element may have\na different meaning in different parts of a sketch. As a re-\nsult, no simple function can correctly classify all features,\neven for a single sketch. Yet humans usually agree on the\nintention of a local feature in spite of ambiguities. For ex-\nample, in Figure 1, nearly identical partial strokes require\ndifferent interpretations. We form a different interpretation\nfor the shapes (b and c), even though it is impossible to dis-\ntinguish between the side of the ellipse and the corner of the\n","Most pen based systems perform some type of early pro-\ncessing of sketched input. Often the extracted information,\nsuch as the description of a shape, the time it was drawn, and\nthe position on the page, serves as the input to higher level\nprocessing, such as recognition, inference, or beatification.\nSeveral approaches to early processing are used in current\nsketch systems. Hse, Shilman, and Newton (2004) deter-\nmine shape by fragmenting a stroke into straight and curved\nsegments and then matching the segments to a template.\nScanScribe (Saund et al. 2002) also segments the input\ninto curved and straight segments as part of a pre-processing\nstage. At the first level of processing, Gross and Do (2000)\nextract features including pen path and aspect ratio, which\nare then matched to templates.\nThough often intuitively simple, the early processing or\npre-processing stages can pose difficult problems. There is\noften a trade-off between making a flexible system that al-\nlows the user to draw in the most unconstrained way possible\nand making an early processing system that performs consis-\ntently and accurately in a noisy sketching environment. For\nexample, Palm Pilot Graffiti is robust enough for millions of\nusers with very little training, but the trade-off is very lim-\nited input. The ideal would be a system that is both flexible\nand accurate.\nHuman interpretation of shapes, such as those in Figure 1,\nis based on a variety of features, including curvature, sharp\ndirection change and whether or not the shape as a whole is\n"],"Page":1,"Number":1,"Type":"Figure","CaptionBB":[442,416,775,461],"Height":1100,"Width":850,"DPI":100,"ImageBB":[473,297,775,401]}