{"Caption":"Figure 1. Effects of descriptor quantization – Informative de- scriptors have low database frequency, leading to high quan- tization error.      (a) An image from the Face class in Cal- ","ImageText":[],"Mention":["It is well known that highly frequent descriptors have low\nquantization error, while rare descriptors have high quan-\ntization error. However, the most frequent descriptors in\na large database of images (e.g., Caltech-101) comprise of\nsimple edges and corners that appear abundantly in all the\nclasses within the database, and therefore are least informa-\ntive for classification (provide very low class discriminativ-\nity). In contrast, the most informative descriptors for clas-\nsification are the ones found in one (or few) class, but are\nrare in other classes. These discriminative descriptors tend\nto be rare in the database, hence get high quantization error.\nThis problem is exemplified in Fig. 1 on a face image from\nCaltech-101, even when using a relatively large codebook\nof quantized descriptors.\n","Caltech-101: This database [8] has 101 classes (animals,\nfurniture, vehicles, flowers, etc.) with high intra-class ap-\npearance and shape variability. We show three types of\ncomparisons on Caltech-101: (i) Comparing performance\nof NBNN to other NN-based methods (Table 1). (ii) Com-\nparing NBNN with a single descriptor-type to other single-\ndescriptor-type image classifiers (both learning-based and\nNN-based) (Fig. 5.a). (iii) Comparing NBNN with mul-\ntiple descriptor-types to other multi-descriptor-type image\nclassifiers (learning-based methods) (Fig. 5.b).\nTable 1 shows a performance comparison on Caltech-\n101 for several NN-based methods. For this experiment\nwe used 15 labelled images, in order to compare to num-\nbers reported in the other works. Our single descrip-\ntor NBNN algorithm (using SIFT) outperforms by a large\ngap all NN-image methods. Moreover, it outperforms\n‘SVM-KNN’ [30] (a hybrid between NN-based and SVM-\nbased, which was considered state-of-the-art until recently).\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[439,163,769,204],"Height":1100,"Width":850,"DPI":100,"ImageBB":[442,63,763,164]}