{"Caption":"Figure 8: The difference in filter quality when using a summed- area-table (left) and a mipmap (right). Successive down sampling with a 2 × 2 box-filter introduces aliasing at higher mipmap levels. ","ImageText":[],"Mention":["We begin with a side-by-side comparison between mipmap- and\nSAT-based soft shadows in Figure 8. Mipmaps produce less accu-\nrate results compared to summed-area-tables for rendering single\nlights due to aliasing artifacts. For complex lighting environments,\nhowever, shadows from many light sources are averaged, which\nmakes mipmapping artifacts less noticeable (Fig. 10 and 11).\n","Mipmaps vs. Summed Area Tables The quality that our\nmethod can achieve depends on the prefiltering process. Mipmaps\nare computationally inexpensive, but their quality is inferior com-\npared to SATs as they re-introduce aliasing again at higher mipmap\nlevels. However, SATs require more storage due to the need to use\nfloating point textures [Hensley et al. 2005] especially when using\nmany area lights. In the case of multiple area lights, as used for\nenvironment mapping, artifacts are masked and mipmapping is a\nviable option. Figure 8 compares both solutions.\n","We thank Kun Xu and the Graphics and Geometric Computing\nGroup at Tsinghua University for providing the robot 3D anima-\ntion sequence, Michael Schwarz for the bitmask- and backprojec-\ntion soft shadow demo, and Thomas Luft for providing the leaf\nmodel from Figure 12. Thanks to Paul Debevec for his light probes\n(http:\/\/www.debevec.org) and to the Stanford University Computer\nGraphics Laboratory for the happy Buddha model. The model from\nFigure 8 was generated by ’Sculpture Generator 1’ by Carlo H.\nSe´quin, UC Berkeley. Part of the research at EDM is funded by\nthe European Regional Development Fund and the Flemish govern-\nment, and part of the research at UCL is funded by EPSRC (grant\nEP\/E047343\/1).\n"],"Page":6,"Number":8,"Type":"Figure","CaptionBB":[73,703,408,744],"Height":1100,"Width":850,"DPI":100,"ImageBB":[75,514,409,696]}