{"Caption":"Figure 6: Linear Regression Relations between Block Coverage and Defect Coverage in normal test- ing ","ImageText":[],"Mention":["Test cases are designed to detect and remove residual\nfaults in program versions which are developed to satisfy\nthe requirements in the software specification. There are two\nmajor system status according to the specification: normal\noperation and exception handling. A test set should contain\ntest cases designed according to these two system opera-\ntion scenarios to hit all kinds of faults. The classification of\nnormal and exceptional status is application-dependent and\ndefined by the specification. Particularly in RSDIMU appli-\ncation, normal operations refer to those situations where at\nmost two sensors fail as the input and at most one sensor\nfails during the test. All the other cases, which cause the\ndifficult conditions where acceleration of the instrument un-\nable to be estimated, are viewed as exceptional operations.\nAs shown in Table 2, the linear correlation of code cov-\nerage and fault coverage changes dramatically from normal\ntesting (0.045) to exceptional testing (0.944). It clearly in-\ndicates the strong correlation of the two measures in excep-\ntional testing, but no correlation in normal testing, as seen\nin Figure 6 and Figure 7, respectively.\n","In normal testing, the code coverage range is relatively\nsmall (see Figure 6), between 48% and 52%. This agrees\nwith the design principle of normal test cases. The normal\noperations should execute the major part of the program\nversions. In such a situation, although high code coverage\nmay be obtained, it cannot be employed to predict the fault\ndetection capability of a normal operational test case. On\nthe contrary, in the case of exceptional testing, the value of\nR-square of 0.944 indicates an obvious positive correlation\nbetween code coverage and fault coverage.\nFigure 7 contains two main clusters. We examine the\nexceptional test cases and find that these two clusters are\ncaused by the specific application. Because of the com-\nplexity of the RSDIMU application, some functions such as\nacceleration estimation, contain large-scale computational\ncode. In some exceptional cases, part of these functions can\nbe executed but others be skipped (e.g., When four sensors\non exactly two faces have failed before the test, and no ad-\nditional sensor fails during the test); while in other cases,\nall these computational codes are skipped according to the\nsystem status. This explains why the code coverage shows\ntwo different ranges and a big gap exists between the two\nclusters. Although this phenomenon is application specific,\nthe strong correlation pattern provides a positive support for\nthe code coverage. We postulate that even in other appli-\ncations, since different exceptional test cases simulate dif-\nferent exceptional situations, a variation of code coverage\nare achieved although the ranges of code coverage may be\nlarger or smaller compared with our application. Test cases\nwith higher code coverage are likely to detect more faults,\ni.e., the correlation between code coverage and fault cover-\nage may still hold. Of course, this needs further empirical\ninvestigation.\nAccording to Table 3, the mutants killed by exceptional\ntesting only fail less frequently (with 55 failures in average)\nthan those failed at normal testing only (with 120 failures\nin average). Considering the total numbers of test cases in\nnormal testing and exceptional testing are 827 and 373, the\nnormalized failure occurrences of these two classes of mu-\ntants are similar (120\/827 vs. 55\/373). Normal testing can\ndetect more faults than exceptional testing (371 vs. 355),\nyet it contains larger test set than exceptional testing.\n"],"Page":5,"Number":6,"Type":"Figure","CaptionBB":[73,936,407,980],"Height":1169,"Width":826,"DPI":100,"ImageBB":[99,695,383,922]}