{"Caption":"Figure 1: A Venn diagram showing the overlapping contributor populations of three top social media. ","ImageText":[],"Mention":["i.e., users that do not contribute social content. On one\nhand, accurate user interest modeling can provide personal-\nized search and recommendation results, and thus may help\nto increase the usage of social software. On the other hand,\nthe available observations of users are sparse and exist in\nmultiple types of media.\nThere resides more information about social relationships\nvia traditional communication media, such as emails, in-\nstant messaging, meeting calendars, etc. Comparing to so-\ncial software, they provide better accuracy in inferring so-\ncial networks, since most people still spend significant time\nof these media. However, these data are more private, and\nthus, seldom could prior researches in the literature utilize\nsuch information without potential infringing privacy or col-\nlaboration from the communication service provider, which\nis actually illegal in some countries. Fortunately, we solved\nthe privacy issue by designing a rigorous distributed social\nsensing system [16] and went through lawyer, privacy offi-\ncer, and union reviews in each country to make sure the\nsystem follows the privacy and data protection laws. Up to\nJan 2010, this system has been approved worldwide except\n5 European countries.\nWe have been capturing the multifaceted activities of 30K+\npeople, including communications such as emails, instant\nmessaging, meetings, etc, and web 2.0 activities, such as\nblogs, wiki, file sharing, and social bookmarking for up to\n3 years in more than 70 countries. After anonymizing the\nidentity and the content of these data, we are able to quanti-\ntatively infer the social networks of 400K employees within\nthe organization. Figure 1 illustrates the three top social\n","We analyze the information content in the electronic com-\nmunication social networks inside a global information tech-\nnology firm with more than 400,000 employees. The data\ncontain people’s electronic communication data, Web 2.0 so-\ncial content and employee job-related information.\nThe people’s electronic communication data include email\nand instant messaging activities. We collected detailed elec-\ntronic communication records of 8952 volunteer employees\nin more than 70 countries. To preserve privacy, the original\ntextual content of an email or text message is not saved.\nInstead, the content is represented as a vector containing\nthe terms appeared in the text as well as their counts af-\nter stop-words removal and stemming. In addition, to con-\nstruct a view of the network that reflects the real com-\nmunications, we eliminate spam and mass email announce-\nments and are left with 20 million emails and text messaging\nchats. Because a volunteer’s communication may include\nnon-contributors, our system can thus infer the connections\nand the amount of communications to the non-contributors.\nFrom the 8952 volunteers’ communication data, we derive\nthe social networks of more than 400K people within the\nfirm, where the strength of a link is computed based the\namount of communication between two people (see Equa-\ntion 5 for the detailed link strength definition).\nWe also collected social content in various Web 2.0 social\nsoftware within the enterprise. Among the 400K employees,\nnearly 16K people created 400K social bookmarks of web\npages [18]. Each bookmark includes the web page url and\na set of tags. A different but overlapping set of 14K people\nshared 140K files, of which 20K files are public files that\nwe can analyze. Two other social media that have smaller\nnumber of users are blogs with 5K contributors and 112K\nentries, and audio\/video media library with 4.2K users and\n61K media files. In this study, we focus on social bookmark-\ning and file sharing, the two Web 2.0 social media that have\nthe widest coverage in the enterprise.\nCombining the users who contributed to one or more of the\nthree sources, we have 31K employees in total (see Figure 1).\n","The comparison results demonstrate the significant ad-\nvantage of combining multiple sources of social information.\nThe mean quality of combining sources outperform the best\nmean quality of using one source (electronic communica-\ntion) by 52%. We attribute the significant improvement to\nthe much wider coverage of the combined social content as\nillustrated by Figure 1. Specifically, each social media is\nused for different purpose. For example, social bookmark-\ning is mostly for organizing and sharing web content while\nelectronic communication is used more often for an infor-\nmation worker’s daily business. Therefore, the content in\nthe different sources may relate to different aspects of a\nuser’s interest. Among the three social media, electronic\ncommunication data gives the best performance because of\nits ubiquity and quantity. Social bookmarking outperforms\nfile sharing, since social bookmarks are more direct and con-\ncise indication of user interests [23].\nHowever, Table 1 also shows that the variance of inference\nquality is huge. We hypothesize that the variance is due to\nthe large variation in people’s contributed content and their\npositions in the information diffusion of the social networks.\nIn Section 6, we test this hypothesis and present a method to\npredict inference quality. By using the predictor to decide\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[73,762,410,792],"Height":1100,"Width":850,"DPI":100,"ImageBB":[74,581,410,748]}