{"Caption":"Figure 5. Scene 1. Detected abnormal observations are labelled red and normal observations are blue. (a) All normal observations of a typical pedestrian (b) The pedestrian follows an unusual path. (c) The observations of a bicyclist are also classified as abnormal, because of the abnormal speed and size of the object. (d) A person stops in the middle of the sidewalk and sits down. Note that the observations were correctly labelled normal before the person sat down. (e) A skateboarder, whose observed size is the same as that of the pedestrian but the speed helps in distinguishing them. Some of the observations are detected normal because of only a slight difference in speed. (f) Unusual size and speed prove to be useful in case of a pedestrian walking on the road. All of the above mentioned tracks are part of the testing video, which is different from the training video. ","ImageText":[{"Text":"(a)","TextBB":[170.599,234.098,181.745,244.098],"Rotation":0},{"Text":"Normal","TextBB":[183.995,234.098,216.764,244.098],"Rotation":0},{"Text":"Track","TextBB":[219.015,234.098,242.071,244.098],"Rotation":0},{"Text":"(d)","TextBB":[165.949,425.842,177.966,435.842],"Rotation":0},{"Text":"Sitting","TextBB":[180.216,425.842,209.262,435.842],"Rotation":0},{"Text":"on","TextBB":[211.512,425.842,223.231,435.842],"Rotation":0},{"Text":"sidewalk","TextBB":[225.482,425.842,263.824,435.842],"Rotation":0},{"Text":"(b)","TextBB":[380.919,234.098,392.989,244.098],"Rotation":0},{"Text":"Unusual","TextBB":[395.239,234.098,431.487,244.098],"Rotation":0},{"Text":"Path","TextBB":[433.737,234.098,453.591,244.098],"Rotation":0},{"Text":"(c)","TextBB":[570.795,234.098,581.58,244.098],"Rotation":0},{"Text":"Bicycle","TextBB":[583.83,234.098,614.476,244.098],"Rotation":0},{"Text":"on","TextBB":[616.726,234.098,628.445,244.098],"Rotation":0},{"Text":"sidewalk","TextBB":[630.695,234.098,669.039,244.098],"Rotation":0},{"Text":"(abnormal","TextBB":[564.043,246.837,609.901,256.836],"Rotation":0},{"Text":"size","TextBB":[612.152,246.837,628.627,256.836],"Rotation":0},{"Text":"and","TextBB":[630.877,246.837,647.872,256.836],"Rotation":0},{"Text":"speed)","TextBB":[650.122,246.837,680.015,256.836],"Rotation":0},{"Text":"(e)","TextBB":[381.843,425.842,393.19,435.842],"Rotation":0},{"Text":"Skateboarder","TextBB":[395.441,425.842,454.833,435.842],"Rotation":0},{"Text":"(abnormal","TextBB":[379.592,438.581,425.45,448.58],"Rotation":0},{"Text":"speed)","TextBB":[427.701,438.581,457.593,448.58],"Rotation":0},{"Text":"(f","TextBB":[569.064,425.842,575.179,435.842],"Rotation":0},{"Text":")","TextBB":[576.314,425.842,579.329,435.842],"Rotation":0},{"Text":"Pedestrian","TextBB":[581.58,425.842,628.308,435.842],"Rotation":0},{"Text":"on","TextBB":[630.559,425.842,642.278,435.842],"Rotation":0},{"Text":"road","TextBB":[644.528,425.842,664.867,435.842],"Rotation":0},{"Text":"(abnormal","TextBB":[560.062,438.581,605.92,448.58],"Rotation":0},{"Text":"size","TextBB":[608.171,438.581,624.646,448.58],"Rotation":0},{"Text":"and","TextBB":[626.896,438.581,643.891,448.58],"Rotation":0},{"Text":"speed)","TextBB":[646.142,438.581,676.034,448.58],"Rotation":0}],"Mention":["where threshold λ is applied to the least probable transi-\ntion. This provides a means of detecting atypical transitions\nthat originated from any one of these higher order transi-\ntions. Hence, both local and global anomalies can be de-\ntected through this framework. Our approach performs on-\nline analysis of the motion patterns to detect anomalies as\nsoon as they occur.\nWe use this framework to detect various types of anoma-\nlous behaviors. Fig. 5 presents various types of detected\nanomalies in a real video. These include pedestrians on the\nroad and grass, skateboarder and bicyclist on the sidewalk,\npedestrians sitting down, etc. In addition, we can also catch\nanomalies like violations of one-way traffic, which is im-\nportant on the road and in some airport hallways. Fig. 4\npresents a synthetic scene to illustrate the case of global\n","cameras. A typical scene observed from the first camera\nis shown in Fig.5. Realtime object detection and tracking\nwas performed using the UCF KNIGHT system [8]. Ini-\ntial training is performed off-line and testing for anoma-\nlous behavior detection was performed using the tracking\nresults from a 30 minute test video. Fig. 6(b) shows the\ndetails of the training and testing sets used for this experi-\nment. Matlab implementation runs at approximately 26 fps\nfor this module on a 3GHz Pentium D PC machine. Fig.\n5 presents the output of abnormal behavior detection in the\ntest sequence. The proposed approach declares an obser-\nvation abnormal as soon as it is received from the tracker.\nFig. 5 shows a set of detected abnormal behaviors1 in ad-\ndition to a normal track. The first one is an unusual path,\nwhere a pedestrian is tracked through a region where not\nenough training tracks were observed. Next, a bicycle is on\nthe sidewalk, which was not present in the training video.\nThe unusual speed and size of the bounding box provides\nevidence of such anomalies. Another similar anomaly (e)\nshows a skateboarder going faster than pedestrians. Most\nof the observations are labelled as abnormal even when the\nobserved size is very similar to that of a pedestrian. (d)\nshows a case where a pedestrian sits down on the sidewalk\n","learnt scene model scene 1 shown in Fig.5. The high inten-\nsity values along the road are generated by the vehicles. As\nthe objects move away from the camera the observed sizes\nreduce, which reflects here as reducing intensities along the\nsidewalk. Similarly, Fig. 8(b) shows the size map for scene\n2 shown in Fig. 7.\n"],"Page":6,"Number":5,"Type":"Figure","CaptionBB":[79,454,769,559],"Height":1100,"Width":850,"DPI":100,"ImageBB":[110,65,739,451]}