{"Caption":"Figure 2: Ad Labeling Interface","ImageText":[],"Mention":["To give an illustrative example, new-jersey-birds.com is a\nweb site devoted to bird watching in new jersey and includes\ninformation and photographs of many birds, including wood-\npeckers. Due to simple keyword matching and bidding [14],\nads might appear on the website such that describe products\nto get rid of woodpeckers while the web site is intended for\nthose more interested in attracting woodpeckers. We worked\nwith the owners of new-jersey-birds.com to alternate be-\ntween two text ads. One ad read “Get Rid of Woodpeckers,\nProducts, reviews and info on getting rid of woodpeckers.\nFree shipping at amazon.com.” The other was identical but\nreplaced “Get Rid of” with “Attract”. Out of 4235 impres-\nsion to get rid of woodpeckers only 2 were clicked while out\nof 4188 impressions to attract woodpeckers, 27 were clicked.\nTo analyze the extent of the problem, we wrote a pro-\ngram to download Google Ads placed on this website on\na page featuring photos of a cute baby goose. 5.4% were\nabout bird watching, 29.9% about hunting, 21.8% about re-\nmoving geese. The remaining ads were more general ads or\nads about other topics (e.g., New Jersey). While many ad\nnetworks do give some limited amount of control for the con-\ntent owner, it normally requires the domain owner to block\nparticular ads or high-level categories without ﬁne-grained\ncontrol.\nWhile one of our research tracks is looking at a general\nsemantic solution to inappropriate ads, in this paper, we ex-\nplore allowing the content owner to create a classiﬁer that\nblocks such ads using active learning. We have designed an\napplication that uses active learning to learn a classiﬁer from\nexamples labeled by the content owner that can automati-\ncally block inappropriate ads. There are two motivations for\nblocking such ads. First, content owners might believe their\nreaders will ﬁnds the ads oﬀensive. Second, the content\nowner may have prior knowledge which leads him believe\nthat his readers would prefer certain ads over others.\nOur ad blocking application has several components. We\nuse a daemon to collect ad information such as the ad URL,\nad text, and the ad landing page HTML. Another compo-\nnent displays ads to the content owner and records feedback\nfor a subset of the ads. See Figure 2 for a picture of the\n"],"Page":6,"Number":2,"Type":"Figure","CaptionBB":[136,231,343,244],"Height":1100,"Width":850,"DPI":100,"ImageBB":[81,74,401,216]}