{"Caption":"Figure 1: An overview of POTSHARDS showing the data transformation component producing shards from objects and distributing them to independent archives. The archives utilize distributed RAID algorithms to securely recover shards in the event of a failure. ","ImageText":[],"Mention":["Data is prepared for storage during ingestion by a data\ntransformation component that transforms objects into a\nset of secure shards which are distributed to the archives,\nas shown in Figure 1; similarly, this component is also\nresponsible for reconstituting objects from shards dur-\ning extraction. The data transformation component runs\non a system separate from the archives on which the\nshards reside, and can fulfill requests from either a sin-\ngle client or many clients, depending on the implementa-\ntion. This approach provides two benefits: the data never\nreaches an archive in an unsecured form; and multiple\nCPU-bound data transformation processes can generate\nshards in parallel for a single set of physical archives.\n","There are three main data objects in POTSHARDS: ob-\njects, fragments and shards. As Figure 1 shows, objects\ncontain the data that users submit to the system at the top\nlevel. Fragments are used within the data transformation\ncomponent during the production of shards, which are\nthe pieces actually stored on the archives. The details of\nthese data entities can be seen in Figure 2.\n","The archive layer in which the shards are stored con-\nsists of independent archives utilizing secure, distributed\nRAID techniques to provide reliability. As Figure 1\nshows, archive-level redundancy is computed across sets\nof unrelated shards, so redundancy groups provide no in-\nsight into shard reassembly. POTSHARDS includes two\nnovel modifications beyond the distributed redundancy\nexplored earlier [4, 30]. The first is a secure reconstruc-\ntion procedure, described in Section 4.2.1, that allows a\nfailed archive’s data to be regenerated in a manner that\nprevents archives from obtaining additional shards dur-\ning the reconstruction; shards from the failed archive\n"],"Page":4,"Number":1,"Type":"Figure","CaptionBB":[436,316,751,393],"Height":1100,"Width":850,"DPI":100,"ImageBB":[451,97,738,317]}