{"Caption":"Figure 13: Blocking for a sector implementing DRP","ImageText":[{"Text":"1","TextBB":[477.476,81.0446,481.494,89.0803],"Rotation":0},{"Text":"0.8","TextBB":[471.449,119.303,481.494,127.339],"Rotation":0},{"Text":"Percent","TextBB":[450.021,202.448,458.057,226.547],"Rotation":3},{"Text":"of","TextBB":[450.021,193.745,458.057,200.439],"Rotation":3},{"Text":"Attempts","TextBB":[450.021,162.269,458.057,191.736],"Rotation":3},{"Text":"Blocked","TextBB":[450.021,133.477,458.057,160.26],"Rotation":3},{"Text":"SDCCH","TextBB":[666.3,87.875,693.091,95.9107],"Rotation":0},{"Text":"(SMS)","TextBB":[695.1,87.875,716.531,95.9107],"Rotation":0},{"Text":"SDCCH","TextBB":[663.196,95.9106,689.987,103.946],"Rotation":0},{"Text":"(Voice)","TextBB":[691.996,95.9106,716.537,103.946],"Rotation":0},{"Text":"TCH","TextBB":[673.92,103.946,689.991,111.982],"Rotation":0},{"Text":"(Voice)","TextBB":[692,103.946,716.541,111.982],"Rotation":0},{"Text":"0.6","TextBB":[471.449,157.562,481.494,165.598],"Rotation":0},{"Text":"0.4","TextBB":[471.449,195.777,481.494,203.812],"Rotation":0},{"Text":"0.2","TextBB":[471.449,234.036,481.494,242.071],"Rotation":0},{"Text":"0","TextBB":[477.476,272.295,481.494,280.33],"Rotation":0},{"Text":"0","TextBB":[485.311,280.33,489.329,288.366],"Rotation":0},{"Text":"500","TextBB":[514.641,280.33,526.695,288.366],"Rotation":0},{"Text":"1000","TextBB":[545.981,280.33,562.052,288.366],"Rotation":0},{"Text":"2000","TextBB":[612.677,280.33,628.748,288.366],"Rotation":0},{"Text":"2500","TextBB":[646.025,280.33,662.097,288.366],"Rotation":0},{"Text":"3000","TextBB":[679.373,280.33,695.445,288.366],"Rotation":0},{"Text":"3500","TextBB":[712.722,280.33,728.793,288.366],"Rotation":0},{"Text":"4000","TextBB":[746.07,280.33,762.141,288.366],"Rotation":0},{"Text":"Time","TextBB":[594.828,292.384,611.792,300.42],"Rotation":0},{"Text":"(seconds)","TextBB":[613.8,292.384,644.593,300.42],"Rotation":0},{"Text":"1500","TextBB":[579.329,280.33,595.4,288.366],"Rotation":0}],"Mention":["are more than sufficient to provide voice service to users. By de-\nsign, SDCCH utilization plateaus well below full capacity. While\nthe SDCCHs used by text messages have an average utilization of\n97%, the SDCCHs used by incoming voice calls average a utiliza-\ntion of 6.3%. This under-use of resources represents a potential loss\nof utility as the majority of text messages (legitimate or otherwise)\ngo undelivered.\nThe difficulty with this solution is correct parameter setting. While\ntheoretical results indicate that allocating 10 SDCCHs only increases\ncall blocking to 1%, voice traffic volumes fluctuate throughout the\nday. Provisioning resources in a static fashion must account for\nworst-case scenarios and therefore leads to conservative settings.\nWhile protecting the network from an attack, such a mechanism\nmay actually hinder the efficiency of normal operation. When traf-\nfic channels are naturally saturated, as may be common during an\nemergency, such hard limits actually prevent users from communi-\ncating. Determining the correct balance between insulation from\nattacks and resource utilization becomes non-trivial. Accordingly,\nwe look to our other techniques for more complete solutions.\nAlthough it is possible to reclaim any number of TCHs for use\nas SDCCHs under the DRP mechanism, we limited the candidate\nnumber of channels for this conversion to two. In these exper-\niments, a single TCH was repurposed into 8 SDCCHs every 10\nminutes during the attack. This separation was designed to allow\nthe network to return to steady state between channel allocations.\nWhile converting only two channels is not enough to completely\neliminate attacks at high intensities, our goal is to understand the\nbehavior of this mechanism.\nThe blocking probabilities for SMS and voice flows in a sector\nimplementing the DRP technique are illustrated in Figure 13. As\nTCHs are converted for use as SDCCHs, the blocking probabili-\nties for both incoming SMS and voice requests fall from 72% to\n53% and eventually 35%. This represents a total reduction of the\nblocking probability by approximately half. Call blocking due to\nTCH exhaustion was not observed despite the reduced number of\navailable TCHs. Figure 14 illustrates a gradual return towards pre-\nattack TCH utilization levels as additional SDCCHs are allocated.\nThe effects of the reprovisioning are also obvious for SDCCH uti-\nlization. The downward spikes represent the sudden influx of ad-\nditional, temporarily unused channels. While SDCCH utilization\nquickly returns to nearly identical levels after each reallocation,\nmore voice calls can be completed due to a decrease probability\nof the attack holding all SDCCHs at any given time.\n"],"Page":10,"Number":13,"Type":"Figure","CaptionBB":[467,312,743,326],"Height":1100,"Width":850,"DPI":100,"ImageBB":[448,79,764,302]}