{"Caption":"Figure 11: Free tokens in incorrect annotations.","ImageText":[],"Mention":["tured annotations with 1 free token output by SAQ-LOW, approxi-\nmately 69% were correct and 31% were incorrect.\nThe bulk of the structured annotations output by SAQ-LOW (Fig-\nure 7) contain either none or one free token. As the number of free\ntokens increases, it becomes less likely that a candidate structured\nannotation is correct. SAQ-LOW penalizes large number of free\ntokens and only outputs structured annotations if it is confident of\ntheir correctness. On the other hand, for IG-5 (Figure 8), more than\n50% of structured annotations contain at least 2 free tokens. By us-\ning the appropriate probabilistic reasoning and dynamic threshold,\nSAQ-LOW achieves higher precision even against IG-0 (zero free\ntokens) or IG-1 (zero or one free tokens). As we can see SAQ\nhandles the entire gamut of free-token presence gracefully.\nOverall Annotation Length: Figures 9 and 10 present the frac-\ntion and normalized fraction of correct and incorrect structured an-\nnotations outputted, with respect to annotation length. The length\nof an annotation is defined as number of the annotated and free\ntokens. Note that Figure 10 presents results for IG-0 rather than\nIG-5. Having established the effect of free tokens with IG-5, we\nwanted a comparison that focuses more on annotated tokens, so we\nchose IG-0 that outputs zero free tokens.\nAn interesting observation in Figure 9(a) is that although SAQ-LOW\nhas not been constrained like IG-0 to output structured annotations\ncontaining at least 2 annotated tokens, only a tiny fraction of its\noutput annotations contain a single annotated token. Intuitively, it\nis extremely hard to confidently interpret a token, corresponding\nto a single attribute value, as a structured query. Most likely the\nkeyword query is an open-world query that was misinterpreted.\nThe bulk of mistakes by IG-0 happen for two-token annotations.\nAs the number of tokens increases, it becomes increasingly un-\nlikely that all 3 or 4 annotated tokens from the same table appeared\nin the same query by chance. Finally, note how different the dis-\ntribution of structured annotations is with respect to the length of\nSAQ-LOW (Figure 9(a)) and IG-0 (Figure 10(a)). By allowing free\ntokens in a structured annotation, SAQ can successfully and cor-\nrectly annotate longer queries, hence achieving much better recall\nwithout sacrificing precision.\nTypes of Free Tokens in Incorrect Annotations: Free tokens\ncan completely invalidate the interpretation of a keyword query\ncaptured by the corresponding structured annotation. Figure 11\ndepicts a categorization of the free tokens present in plausible an-\nnotations output by SAQ and labeled as incorrect. The goal of the\nexperiment is to understand the source of the errors in our approach.\nWe distinguish four categories of free tokens: (i) Open-world al-\ntering tokens: This includes free tokens such as “review”, “drivers”\n"],"Page":11,"Number":11,"Type":"Figure","CaptionBB":[477,200,732,213],"Height":1100,"Width":850,"DPI":100,"ImageBB":[486,69,727,198]}