{"Caption":"Figure 2: The undersampled ear of the Stanford bunny (a) using normal averaging plane fit (SPSS) with h = 1.8 (b) and our new APSS with h = 1.7 (c). ","ImageText":[{"Text":"(a)","TextBB":[165.156,179.316,178.979,190.449],"Rotation":0},{"Text":"(b)","TextBB":[273.911,179.316,288.431,190.449],"Rotation":0},{"Text":"(c)","TextBB":[390.536,179.316,404.359,190.449],"Rotation":0}],"Mention":["In this paper we present a novel definition of moving least squares\nsurfaces called algebraic point set surfaces (APSS). The key idea\nis to directly fit a higher order algebraic surface [Pratt 1987] rather\nthan a plane. For computational efficiency all methods in this paper\nfocus on algebraic sphere fitting, but the general concept could be\napplied to higher order surfaces as well. The main advantage of\nthe sphere fitting is its significantly improved stability in situations\nwhere planar MLS fails. For instance, tight data approximation is\naccomplished, spheres perform much better in the correct handling\nof sheet separation (figure 3) and exhibit a high degree of stability\nboth in cases of undersampling (figure 2) and for very large weight\nfunctions. The specific properties of algebraic spheres make APSS\nsuperior to simple geometric sphere fitting. It allows us to elegantly\nhandle planar areas or regions around inflection points as limits in\nwhich the algebraic sphere naturally degenerates to a plane.\n","The sharpness control of a crease feature by a user parameter can\neasily be added to our concept. To this end we insert all samples\ninto all groups but assign a lower weight to a sample when inserted\ninto a group with a tag different from its own one. We define a\nglobal or local parameter α ∈ [0,1] which modulates the weight of\nthese samples. For α = 0 we obtain a fully sharp feature, for α = 1\nthe feature is completely smoothed since all groups are weighted\nidentically. Values in-between permit a continuous transition from\nsmooth to sharp (figure 12).\n"],"Page":2,"Number":2,"Type":"Figure","CaptionBB":[73,194,408,235],"Height":1100,"Width":850,"DPI":100,"ImageBB":[73,73,411,194]}