{"Caption":"Figure 2: Wall plug scene - details on the plugs, clearly visible in the color image, are entirely masked by random noise in an unsmoothed 3D rendering of a single depth image. ","ImageText":[{"Text":"(a)","TextBB":[160.438,255.783,172.725,265.923],"Rotation":0},{"Text":"Color","TextBB":[175.503,255.783,200.72,265.923],"Rotation":0},{"Text":"recording","TextBB":[203.476,255.783,245.895,265.923],"Rotation":0},{"Text":"in","TextBB":[248.662,255.783,257.274,265.923],"Rotation":0},{"Text":"high","TextBB":[260.053,255.783,279.734,265.923],"Rotation":0},{"Text":"resolution","TextBB":[282.491,255.783,326.769,265.923],"Rotation":0},{"Text":"(b)","TextBB":[535.513,255.783,548.422,265.923],"Rotation":0},{"Text":"3D","TextBB":[551.19,255.783,564.718,265.923],"Rotation":0},{"Text":"model","TextBB":[567.487,255.783,595.165,265.923],"Rotation":0},{"Text":"of","TextBB":[597.923,255.783,607.145,265.923],"Rotation":0},{"Text":"single","TextBB":[609.913,255.783,636.353,265.923],"Rotation":0},{"Text":"raw","TextBB":[639.122,255.783,655.551,265.923],"Rotation":0},{"Text":"frame","TextBB":[658.32,255.783,684.138,265.923],"Rotation":0}],"Mention":["The Z-cam [15] used in our experiments exploits the\ntime-of-flight principle of light to measure the distance of\neach pixel from the scene. The camera features a lens and\na CMOS sensor, thus is based on video camera technology.\nHowever, it houses additional components, like a ring of in-\nfrared LEDs and a rapid controlled shutter, to enable depth\nrather than intensity measurement only. When capturing a\nsingle frame, the camera emits a single-pulse light wave-\nfront from the LEDs into the scene. The returned pulse is\n”shaped” by the scene structure and this shape information\ncan be extracted by gating the returned signal with the rapid\nshutter. After normalization, the measured intensity values\ncan be interpreted as depth values. The Z-cam can measure\nfull frame depth at video rate and at a resolution of 320×240\npixels. The control of the shutters also enables the defini-\ntion of a 3D frustum in space in which depth measurements\nare taken.\nIn contrast to competing TOF cameras, the Z-cam fea-\ntures a normal video camera of 640 × 480 pixels in the\nsame device which enables recording of texture-mapped ge-\nometry. Unfortunately, video and depth are not recorded\nthrough the same optics and the homographic registration of\nboth data provided by the manufacturer can easily be sev-\neral pixels off. In our comparison experiments we therefore\nresort to our own external color camera (Sect. 5).\nAlthough the Z-cam delivers scene geometry at unprece-\ndented speed and largely independently of scene texture, the\nquality of recovered 3D data in a single frame is not suffi-\ncient for high-quality 3D scanning, as shown in Fig. 2b. In\nthis image three wall plugs should be visible, but are mostly\nmasked by noise. The depth measurements are starkly con-\n","For comparison, we implemented a joint bilateral up-\nsampling (JBU) approach [8], which uses a high-resolution\ncolor and a low resolution depth image to raise the depth\nresolution to the one of the color image. The color im-\nage was recorded using a standard digital camera and has\nbeen manually aligned using a homographic warp. By in-\nspection the alignment error was determined to zero pix-\nels for most pixels, while three pixels being the maximum\nerror. The method’s implicit assumption that color and\ndepth edges are collocated is frequently violated in our wall\nplug scene causing erroneous reconstructions. Although the\ndepth map, Fig. 3c, shows crisp edges which is visually\npleasing if only the gray scale image is looked at, the ac-\ntual reconstruction exhibits several errors. For instance, the\nmethod wrongly reconstructs the shadowed area B on the\nripple of the left wall plug, Fig. 2a, as a depth discontinuity\nthat protrudes all the way through the scene Fig. 3f. Also,\njoint bilateral upsampling performs excessive smoothing in\nareas with low image gradient. Therefore, the dent in area A\non the right wall plug, whose edges are not clear in the color\nimage, is entirely smoothed out. Also, shadows on the back\nof the table appear as geometry merged to the lower part\nof the plugs, and the top of the right plug is cut off due\ncolor similarity to the background. We thus conclude that a\nslightly higher remaining level of noise, as in in our results,\nis preferable over such excessive smoothing since in the lat-\nter case actual shape detail is lost or incorrectly estimated.\n","Resolving thin structure: We wanted to verify that our\nsuperresolution method can resolve thin structures. There-\nfore our first setup shows three wall plugs in front of a white\nwall, Fig. 2a. The scene is approx. 50 cm away from the\ncamera, and was recorded from 15 displaced positions to\nperform superresolution. For this scene, the camera was\nconfigured to record objects from 0 cm up to 100 cm away.\nTo illustrate the performance of our method, we focus on a\ndent and a long thin gap in the wall plugs which are marked\nas A and B, respectively, in Fig. 2a. Since these features are\nclose to the resolution limit of the Z-cam, they do not appear\nwell in a single depth image, Fig. 3a, and consequently also\nnot in the corresponding low resolution 3D reconstruction,\nFig. 3d. In contrast, our 4-times superresolved result accu-\nrately captures these details, as visible in the depth image\nFig. 3b, and in geometry Fig. 3e where they appear as true\n3D structure with correct depth. To display the 3D geome-\ntry we convert the depth maps into triangulated height fields\nand render them using basic Phong shading. Please note\nthat for fair comparison we always perform superresolution\nat 8-bit depth precision in all tested methods, as this is the\nlimit of the software by Milanfar et al. [11]. Therefore, dis-\ncretization artifacts in the form of depth steps are visible in\nthe renderings. To verify that our 3D reconstructions do not\n"],"Page":4,"Number":2,"Type":"Figure","CaptionBB":[80,275,769,306],"Height":1100,"Width":850,"DPI":100,"ImageBB":[125,98,727,268]}