{"Caption":"Figure 1: Interface Synthesis for HW-to-HW Communication","ImageText":[{"Text":"p_Event","TextBB":[306.76,103.366,349.227,114.073],"Rotation":0},{"Text":"Evt_p","TextBB":[428.411,117.887,462.235,130.123],"Rotation":0},{"Text":"p_Ack","TextBB":[386.483,132.893,418.648,143.6],"Rotation":0},{"Text":"p_Data","TextBB":[232.942,145.289,275.589,157.525],"Rotation":0},{"Text":"p_Data","TextBB":[326.248,152.381,363.564,163.088],"Rotation":0},{"Text":"Consumer","TextBB":[447.439,153.556,508.447,165.792],"Rotation":0},{"Text":"Producer","TextBB":[225.641,167.729,279.308,179.965],"Rotation":0},{"Text":"port_receive(p,...)","TextBB":[537.598,169.56,615.34,178.737],"Rotation":0},{"Text":"Evt_p","TextBB":[430.892,189.933,464.716,202.17],"Rotation":0},{"Text":"port_send(p,...)","TextBB":[205.914,217.284,273.189,226.461],"Rotation":0},{"Text":"Consumer","TextBB":[447.676,222.295,508.684,234.531],"Rotation":0}],"Mention":["One possible architecture for a port-based hardware to hardware communication is shown in Figure\n1. In this case, there is a direct data connection between producer and consumer. Additionally, control\nlines are synthesized according to the API usage. If the port is ever used for a blocking send, then an\nacknowledge line from the consumer to the producer is necessary. Therefore, the producer is suspended\nuntil it receives an acknowledge from the consumer in case of a blocking communication. For communi-\ncations with multiple consumers, the producer wait for the acknowledge of all consumers. This behavior\nis implemented with a logic OR of the individual acknowledges of the consumers, as shown in Figure 1.\nSimilarly, an event line is added from the producer to each consumer for the case when blocking receives\nare specified. Since the event and acknowledge control signals are only synthesized when needed, they\nare shown with dashed lines in Figure 1.\nOther architectures are also possible from the same System Level API. For instance, it is possible to\ngenerate a Transaction Level Model with AMBA-bus transactions for each port primitive. In this case,\nthe port send and port receive primitives are replaced by a set of calls to the AMBATransaction-\nLevel API [ARM03].\n"],"Page":6,"Number":1,"Type":"Figure","CaptionBB":[225,264,600,280],"Height":1169,"Width":827,"DPI":100,"ImageBB":[190,100,636,246]}