{"Caption":"Figure 2. Using Rayleigh and Fisher-Tippett distributions to model ultrasound image intensities in the magnitude IQ (top row) and log magnitude IQ images (bottom row), respectively. ","ImageText":[{"Text":"(a)","TextBB":[205.039,412.325,220.399,424.696],"Rotation":0},{"Text":"(b)","TextBB":[397.034,412.325,413.169,424.696],"Rotation":0},{"Text":"(c)","TextBB":[598.052,412.325,613.411,424.696],"Rotation":0},{"Text":"(d)","TextBB":[204.651,584.953,220.786,597.324],"Rotation":0},{"Text":"(e)","TextBB":[397.422,584.953,412.781,597.324],"Rotation":0},{"Text":"(f)","TextBB":[598.826,584.953,612.65,597.324],"Rotation":0}],"Mention":["which is a doubly exponential distribution that has the form\nof a Fisher-Tippett distribution. This distribution therefore\nis the theoretical model for the image intensities for fully\nformed speckle in the log-compressed IQ image.\nTo verify these theoretical models, we analyzed a real ul-\ntrasound image taken of a lesion phantom (ATS Laborato-\nries Inc, Model 539), shown in Figure 2. We selected an im-\nage region (indicated by a white box) corresponding to the\n“soft tissue,” where primary variation in the image intensity\nis due the speckle. The magnitude of the IQ image is shown\nin (a); notice the dark appearance resulting from the large\ndynamic range of the intensities. We show the histogram of\nthe magnitude IQ image in (b), and fit the histogram to a\nGaussian distribution, which does not accurately represent\nthe distribution, with a mean square error (MSE) of 13,120.\nIn (c) we fit the histogram of the magnitude IQ image to a\nRayleigh distribution, which is a much more accurate repre-\nsentation, resulting in a MSE of 3961, which is 69.8% less\nthan that of the Gaussian fit.\nThe log-compressed image is shown in (d) of Figure 2,\nwhich is a typical presentation of an ultrasound image. As\nbefore, we selected a region of pixels in the image and fit a\nGaussian distribution to the histogram as shown in (e). No-\ntice that a Gaussian distribution is similarly inaccurate for\nmodeling this asymmetric histogram, with a MSE for this\nfit of 14,770. In contrast, in (f) we fit a Fisher-Tippett dis-\ntribution, which very accurately models the intensity distri-\nbution, with a MSE of 3938, which is 73.3% less than that\nof the Gaussian fit. All distributions in this paper were opti-\nmally fit using analytic methods. Similar results were found\nfor other soft tissue regions in the image.\nFrom this analysis we conclude that the Rayleigh distri-\nbution is a good choice for the magnitude image, and the\nFisher-Tippett distribution is preferred for the log magni-\ntude image. We also note that application of the Rayleigh\ndistribution to the log-compressed IQ image is not ideal,\n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[84,626,740,658],"Height":1100,"Width":850,"DPI":100,"ImageBB":[129,254,700,599]}