{"Caption":"Figure 2. A placeholder is created when files are deleted,   indicating the filename of the file and preserving its    relationship to surrounding files and annotations. ","ImageText":[],"Mention":["Our WikiFolders prototype application modifies the way \nthat folders appear within the existing Mac OS X file \nbrowser. Its purpose is to enable individuals to organize and \ndocument their digital artifacts as if the folder itself were a \nwiki page (Figure 1). The end user sees the traditional file \nbrowser interface as usual, with typical options for \ndisplaying files as lists, icons, and so on. However, there \nare several key differences: \n1. The user has an additional option of seeing file listings \nin a text editor, adding text annotations to the listing, \nand modifying its appearance and spatial layout using a \nsimplified, wiki-based markup language (Figure 1a). \n2. The file browser’s “icon” view displays the folder’s \ncontents and associated annotation inline, as specified \nby the user’s markup directives (Figure 1b).  \n3. The annotated view of the folder is automatically \npresented to anyone who accesses the folder (e.g., as a \nshared folder) using the standard OS X file browser, \neven if they do not have the WikiFolders application \ninstalled themselves.  \n4. The WikiFolders application provides these capabilities \nwithout requiring wholesale changes to the underlying \nfile system or incurring the interaction costs typically \nassociated with wikis’ publish-and-annotate model. \n","Since any application can potentially change the contents of \nan annotated folder, it is important that the annotation text \nbe kept up-to-date, in order to prevent inconsistencies \nbetween the folder display layout and the contents of the \nmarkup file. The WikiFolders application maintains a list of \nall active WikiFolders on the local machine and constantly \nmonitors these folders for changes using the fsevents file \nmonitoring framework in OS X. When files are created, \nWikiFolders detects this action and appends a \ncorresponding link to the new file to the end of the markup \nfile. When files are deleted, their position in the markup is \nreplaced with a text placeholder (e.g., “(File deleted: \nDocument.txt”), indicating the prior spatial location and \nname of the deleted file (Figure 2). \n"],"Page":3,"Number":2,"Type":"Figure","CaptionBB":[455,571,758,616],"Height":1100,"Width":850,"DPI":100,"ImageBB":[543,512,672,572]}