{"Caption":"Figure 6: Precision and Coverage using General Web Queries","ImageText":[],"Mention":["To compensate, we measured coverage, defined as the number of\ncovered queries, as a proxy of relative recall.\nFigure 6 presents the annotation precision-coverage plot, for dif-\nferent threshold values. SAQ uses threshold values ranging in 1 ≤\n𝜃 ≤ 1000. Many interesting trends emerge from Figure 6. With re-\nspect to SAQ-MED and SAQ-LOW, the annotation precision achieved\nis extremely high, ranging from 0.73 to 0.89 for SAQ-MED and\n0.86 to 0.97 for SAQ-LOW. Expectedly, SAQ-LOW’s precision is\nhigher than SAQ-MED, as SAQ-MED is more tolerant towards the\npresence of free tokens in a structured annotation. As discussed,\nfree tokens have the potential to completely distort the interpreta-\ntion of the remainder of the query. Hence, by being more tolerant,\nSAQ-MED misinterprets queries that contain free tokens more fre-\nquently than SAQ-LOW. Additionally, the effect of the threshold\non precision is pronounced for both variations: a higher threshold\nresults value results in higher precision.\nThe annotation precision of IG-1 and IG-5 is extremely low,\ndemonstrating the challenge that free tokens introduce and the value\nof treating them appropriately. Even a single free token (IG-1) can\nhave a deleterious effect on precision. However, even IG-0, which\nonly outputs annotations with zero free tokens, offers lower preci-\nsion than the SAQ variations. The IG-0 algorithm, by not reasoning\nin a probabilistic manner, makes a variety of mistakes, the most im-\nportant of which to erroneously identify latent structured semantics\nin open-world queries. The “white tiger” example mention in Sec-\ntion 1 falls in this category. To verify this claim, we collected and\nlabeled a sample of 150 additional structured annotations that were\noutput by IG-0, but rejected by SAQ-MED with 𝜃 = 1. SAQ’s\ndecision was correct approximately 90% of the time.\nWith respect to coverage, as expected, the more conservative\nvariations of SAQ, which demonstrated higher precision, have lower\ncoverage values. SAQ-MED offers higher coverage than SAQ-LOW,\nwhile increased threshold values result in reduced coverage. Note\nalso the very poor coverage of IG-0. SAQ, by allowing and prop-\nerly handling free tokens, increases substantially the coverage, with-\nout sacrificing precision.\n"],"Page":10,"Number":6,"Type":"Figure","CaptionBB":[75,242,404,255],"Height":1100,"Width":850,"DPI":100,"ImageBB":[87,69,390,238]}