{"Caption":"Figure 1: A velocity, density, and temperature source injects hot high-velocity smoke subject to a buoyancy force. Left: Un- guided simulation (2563 ). Middle: Unguided simulation (643 ). Right: 2563 simulation guided by the 643 simulation. There is poor resemblance between the unguided simulations. The guided simulation follows the general flow of the low resolution simulation, and adds dynamic high frequency detail. ","ImageText":[],"Mention":["cil needs to be stored. Currently we only exploit this on the\ntop level.We do not even store the matrix operator at the top-\nmost multigrid level when separability can be exploited be-\ncause we found that both matrix multiply and relaxation can\nbe computed efficiently, in parallel, on the fly. For the 2563\nguided smoke spray example (see section 8 and Figure 1)\nusing a lowpass filter of width 9, the combined effect of our\nindexed representation and separability reduced total stor-\nage requirements of the matrix operators to 208MB from the\n4.04TB required if storing all non-zero entries.In the case of\nmoving boundaries, the stencils at the grid points that change\nstatus from boundary to fluid or vice versa are modified by\nthe penalization method. Although in the worst case the en-\ntire matrix has to be re-computed when this happens, in prac-\ntice only a few grid points, compared to the total number of\ngrid points in the domain, change status. Hence the matrix\ncan be re-computed locally by only updating the stencil val-\nues that are actually affected by the change. The locality of\nthe change is maintained throughout lower multigrid levels,\nhence facilitating a fast update to matrix operators at all lev-\nels.\n","filter stencil. The guiding matrix operators required 72MB\nand took 119 seconds to compute. 4 multigrid cycles were\nrequired to converge to a divergence of roughly 10−5 for the\nguided (31 seconds per frame) and unguided (16 seconds\nper frame) simulations at resolution 64× 256× 64. Figure\n6 illustrates that for Eulerian smoke simulations, undesir-\nable features may develop over time when explicitly blend-\ning the low frequencies of the current velocity field with the\nupsampled guiding velocity field as proposed in [TKPR06].\nGranted, their method is based on guiding particles whereas\nwe set the low frequencies everywhere in the domain. Addi-\ntionally, the choice of blend-factor used in [TKPR06] may,\nin our experience, give plausible results for one simulation,\nbut undesired features for another. This implies that manual\nexperimentation in high resolution may be required. How-\never, if a successful blend-factor can be found, this simple\nmethod provides a faster alternative to our method.\nRising Smoke Column with Moving Boundary\nThis setup is similar to the Rising Smoke Column simula-\ntion except that a moving boundary is timed to touch the top\nof the smoke column in low resolution as shown in Figure\n4. In high resolution the boundary passes through the faster\nmoving smoke. The guided high-resolution simulation re-\ntains the qualitative features of the low-resolution simulation\nand adds higher frequency detail. The initial guiding matrix\noperators required 280MB and took 254 seconds to com-\npute. The guided and unguided high resolution simulations\ntook respectively 84 and 45 seconds per frame.\nSmoke Spray\nA velocity-, density- and temperature-source injects hot\nhigh-velocity smoke subject to a buoyancy force as shown\nin Figure 1. Again, the guided simulation retains the low\nfrequency qualitative features of its guiding simulation. The\ntotal storage required for the matrix operators of the guided\nsimulation is 208MB and the computation took 696 seconds.\nThe guided simulation took 580 seconds per frame and the\nunguided simulation 315 seconds at resolution 2563.\nGuiding Curves\nA low-resolution, non-physically based velocity field in the\nshape of a torus is used to guide a smoke torus (see Figure\n8). Both the lowpass filter F and the guiding parameter α\nvary spatially; the identity filter is used in a narrow band\ninside the initial smoke band to prevent drift of the low-\nfrequency velocities, and guiding is gradually diminished\noutside the initial smoke band by increasing α. Vorticity con-\nfinement [FSJ01] is used to induce high-frequency instabili-\nties. The rightmost images of Figure 8 show the same setup\nwith a trefoil knot curve. For both simulations it was neces-\nsary to uniformly quantize the values of α to limit the num-\nber of unique stencils in the matrix operators and thereby\nthe storage requirements. We have verified experimentally\nthat the quantization did not cause visual artifacts. For the\ntorus simulation, the matrix operators required 1496MB and\ntook 1061 seconds to compute. The simulation ran for 150\n"],"Page":2,"Number":1,"Type":"Figure","CaptionBB":[98,269,731,328],"Height":1169,"Width":827,"DPI":100,"ImageBB":[105,111,722,266]}