{"Caption":"Figure 4: Node groups in Preferred Group Broad- casting. ","ImageText":[{"Text":"Transmitting","TextBB":[558.093,156.95,594.07,162.999],"Rotation":0},{"Text":"node","TextBB":[558.093,164.806,572.645,170.855],"Rotation":0},{"Text":"In","TextBB":[610.056,160.424,616.605,167.69],"Rotation":0},{"Text":"PG","TextBB":[634.191,160.424,645.546,167.69],"Rotation":0},{"Text":"Out","TextBB":[650.884,160.463,663.534,167.73],"Rotation":0},{"Text":"IT","TextBB":[678.711,199.406,685.693,206.672],"Rotation":0},{"Text":"OT","TextBB":[675.844,217.788,686.753,225.054],"Rotation":0},{"Text":"rxThresh","TextBB":[662.019,235.325,693.03,242.591],"Rotation":0}],"Mention":["In a broadcasting-based route discovery process, no spe-\nial criteria are used when choosing the intermediate nodes.\nhus it can easily be the case that two nodes in a path are\nery close to each other, or vice versa are separated by a dis-\nance close to the maximum communication range. Neither\nf the cases is desirable. Short distances between hops im-\nly a high number of hops in the path. On the other hand,\nhen a hop length is close to a maximum coverage range,\nhe connection can be easily lost if one of the nodes moves\nut of the range, or slightly changed interference jams the\neak signal.\nMoreover, poor connection quality leads to throughput\negradation, due to an increased number of errors. If an\ndaptive data-rate is used, then a high bit error rate forces\nhe data-rate to decrease, and this step may lead to a bot-\nleneck problem in the current node.\nAnother factor that seriously limits the performance of\nd hoc networks is the “hidden terminal” problem. Using\nTS\/CTS handshake, node A “secures” the transmission of\ndata packet to node B. However, only the nodes that are\nithin the receiving range from node A and B adjust their\nAV (Network Allocation Vector) not to interfere with the\nata transmission from A to B. Other nodes just perform\nhe carrier sense step, and whenever the medium is free may\ntart a transmission. If then the signal to noise ratio reaches\nome threshold (e.g., 10 dB) in node B, then A’s transmis-\nion fails. The weaker the signal from A in node B, the easier\nt is that the communication A−B can be interrupted by a\nidden terminal.\nPGB addresses all of the above cases by allowing only cer-\nain nodes to rebroadcast a route request. This restriction\nignificantly limits the set of possible intermediate nodes and\nn turn automatically reduces the routing load. PGB works\nn both cases: when the information about nodes coordi-\nates is available and when not.\nPGB classifies each node that receives a broadcast packet\ne.g., route request) into one of the three groups, based on\nhe sensed signal level (Figure 4):\n• Preferred group (PG) – the preferred set of nodes;\n• IN group – nodes with a signal stronger than in PG;\n• OUT group – nodes with a signal weaker than in PG.\n","ared to two values: Inner Threshold (IT ) and Outer Thresh-\nld (OT ). We assume that signal power is measured in\nBm 4. Both thresholds have the following relation to the\nThe IEEE 802.11 standard defines a mechanism by which\nF energy is to be measured by the circuitry on a wireless\nIC. This numeric value is an integer with an allowable\n"],"Page":5,"Number":4,"Type":"Figure","CaptionBB":[440,279,774,307],"Height":1169,"Width":850,"DPI":100,"ImageBB":[514,95,696,249]}